app/Controllers/User.php

SELECT *
FROM `user`
---
    public function index()
    {
        $user = new UserModel();
        $datauser = $user->findall();