app/Models/UserModel.php

    function simpan($data){
        return $this->db->table('user')->insert($data);
---
INSERT INTO `user` (`username`, `password`) VALUES ('ruslanmaulani', '1234')